Catalogs/КалькуляторПланаРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>КалькуляторПланаРабот</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ПланРабот</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокПоСмете</Name>
					<Comment>Разница между суммой по смете и суммой плана работ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполненВключая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФронтРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Comment>Первый день месяца</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КалькуляторПланаРабот/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Функция РасчетСуммыВсего( )
	СуммаВсего = Объект.ФронтРабот.Итог("Сумма") + Объект.ОстатокПоСмете;
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоФР()
	// заполняем дерево
	Объект.ФронтРабот.Сортировать("Месяц,ТарифнаяСтавка");
	тз 		= Объект.ФронтРабот.Выгрузить();
	тзНС 	= тз.Скопировать();
	тзНС.Свернуть("Месяц", "");
	тзНС.Сортировать("Месяц");
	
	// 
	ВеткиДерева = ДеревоФР.ПолучитьЭлементы();
	ВеткиДерева.Очистить();
	
	Для Каждого СтрНС ИЗ тзНС Цикл
		Ветка = ВеткиДерева.Добавить();
		Ветка.Месяц = СтрНС.Месяц;
		мСтрок = тз.НайтиСтроки(Новый Структура("Месяц", СтрНС.Месяц ));
		Для Каждого мСтрока ИЗ мСтрок Цикл
			Подветка 			= Ветка.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств( Подветка, мСтрока );
			Ветка.Количество	= Ветка.Количество 	+ мСтрока.Количество;
			Ветка.Сумма			= Ветка.Сумма 		+ мСтрока.Сумма;
			
		КонецЦикла;
	КонецЦикла;
	
	// для понимания
	Объект.ОстатокПоСмете = СуммаВсего - Объект.ФронтРабот.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// 
	ЗаполнитьДеревоФР();
КонецПроцедуры

//****************************************
//
// 2014
//
// если нет то добавляем
&НаСервере
Процедура ФронтРабот_ОбработатьИзменения( Команда, сКалендарь = Неопределено, НазвПоляКалендаря = "" )
	СправКПР = РеквизитФормыВЗначение("Объект");
	
	УП_ПланыРаботПоПроектам.ОбработатьИзмененияФронтаРабот( СправКПР, Период, Количество, Должность, СправКПР.ИсполненВключая,
																Команда, сКалендарь, НазвПоляКалендаря);
	
	ЗначениеВРеквизитФормы( СправКПР, "Объект");	
	
	ЗаполнитьДеревоФР();
КонецПроцедуры

//*******************************************************************
// изменение плана работ

&НаКлиенте
Процедура УстановитьВПланеРабот(Команда)
	ФронтРабот_ОбработатьИзменения( "Установить" );
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВПланеРабот(Команда)
	ФронтРабот_ОбработатьИзменения( "Очистить" );
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПланРабот(Команда)
	ФронтРабот_ОбработатьИзменения( "Добавить" );
КонецПроцедуры

&НаКлиенте
Процедура ВычестьИзПланаРабот(Команда)
	ФронтРабот_ОбработатьИзменения( "Вычесть" );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РабочиеДниПоМесяцам( ДатаНачала, ДатаОкончания);
	Возврат УП_ПланыРаботПоПроектам.РабочиеДниПоМесяцам( ДатаНачала, ДатаОкончания);
КонецФункции

 &НаКлиенте
Процедура УстановитьПоКалендарю( НазвПоказателя )
	Ставка = СтавкаПоДолжности( Должность );
	
	Если ЗначениеЗаполнено( Ставка ) 
	И 	 Количество <> 0 Тогда
		// рабочих дней и т.д. по месяцам
		сМ = РабочиеДниПоМесяцам( Период.ДатаНачала, Период.ДатаОкончания);
		//
		ФронтРабот_ОбработатьИзменения( "Установить",  сМ, НазвПоказателя );
		
	Иначе
		ПоказатьПредупреждение(,"Должны быть указаны должность и количество часов!", 10);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКалендарюВдень(Команда)
	УстановитьПоКалендарю( "РДней" );
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКалендарюВнеделю(Команда)
	УстановитьПоКалендарю( "РНедель" );
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьДеревоФР();				
	
КонецПроцедуры

 
&НаСервереБезКонтекста
Функция ВеличинаСтавкиФОТ( ТарифнаяСтавка, Месяц, Показатель )
	Возврат ПоказательТарифнойСтавки( ТарифнаяСтавка, Месяц, Показатель);
КонецФункции

&НаСервереБезКонтекста
Функция ВеличинаСтавкиФОТДляПодразделения( Подразделение, ТарифнаяСтавка, Месяц )
	Возврат СтавкаФОТПодразделения( Подразделение, ТарифнаяСтавка, Месяц );
КонецФункции

&НаСервереБезКонтекста
Функция ГодСметыЗадачиПроекта( ЗадачаПроекта, ГодПроекта )
	Если ЗначениеЗаполнено( ЗадачаПроекта ) Тогда
		Возврат ЗадачаПроекта.Владелец.ГодПроекта;
	Иначе
		Возврат ГодПроекта;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ПересчетСтроки( СтрФР )
	СтрФР.Месяц 	= НачалоМесяца(СтрФР.Месяц);
	//СтрФР.СтавкаФОТ	= ВеличинаСтавкиФОТ( СтрФР.ТарифнаяСтавка, СтрФР.Месяц, "СтавкаФОТ" );
	// 2017 02 01
	Если ГодСметыЗадачиПроекта( Объект.ЗадачаПроекта, Объект.ГодПроекта ) >= 2017 Тогда
		СтрФР.СтавкаФОТ	= ВеличинаСтавкиФОТ( СтрФР.ТарифнаяСтавка, СтрФР.Месяц, "СтавкаФОТ" );
	Иначе
		СтрФР.СтавкаФОТ	= ВеличинаСтавкиФОТДляПодразделения( Объект.Подразделение, СтрФР.ТарифнаяСтавка, СтрФР.Месяц );
	КонецЕсли;
	СтрФР.Сумма 	= СтрФР.Количество * СтрФР.СтавкаФОТ;
	
КонецПроцедуры

&НаКлиенте
Процедура ФронтРаботПередНачаломИзменения(Элемент, Отказ)
	Месяц = Элементы.ФронтРабот.ТекущиеДанные.Месяц;
	Если ЗначениеЗаполнено( Объект.ИсполненВключая ) и ЗначениеЗаполнено( Месяц ) Тогда
		Если Месяц <= Объект.ИсполненВключая Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура ФронтРаботПриИзменении(Элемент)
	ПересчетСтроки( Элементы.ФронтРабот.ТекущиеДанные );
КонецПроцедуры

&НаКлиенте
Процедура ОстатокПоСметеПриИзменении(Элемент)
	РасчетСуммыВсего();
КонецПроцедуры

&НаКлиенте
Процедура ИсполненВключаяПриИзменении(Элемент)
	Объект.ИсполненВключая = НачалоМесяца( Объект.ИсполненВключая );
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя =  "ГруппаФронтРабот" Тогда
		ЗаполнитьДеревоФР();				
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция СтавкаПоДолжности( Должность  ) 
	Возврат УП_КадрыСервер.СтавкаПоДолжности( Должность );
КонецФункции


&НаКлиенте
Процедура ДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыД = Новый Структура;
	ПараметрыД.Вставить("Подразделение", 	Объект.Подразделение );
	
	ФормаВыбора 	= ПолучитьФорму( "Справочник.Должности.Форма.ФормаВыбораДляПланаРабот", ПараметрыД, Элемент );
	ФормаВыбора.Открыть();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
